Polycom-Open-Firmware/brainslug/sdkconfig.defaults
# --- target ---
CONFIG_IDF_TARGET="esp32"

# --- partition table with two OTA slots ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_APP_ROLLBACK_ENABLE=y

# --- ethernet (LAN8720 on WESP32) ---
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
CONFIG_ETH_RMII_CLK_IN_GPIO=0

# --- httpd / lwip — give us headroom for OTA upload + UART reads ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_LWIP_MAX_SOCKETS=10

# --- log level ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- main task stack ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
